{"format": "graph-model", "generatedBy": "2.11.0", "convertedBy": "TensorFlow.js Converter v4.2.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "384"}, {"size": "1"}]}}}, "outputs": {"dense_18": {"name": "Identity:0", "dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "-1"}, {"size": "408"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/layer_normalization_20/batchnorm/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/sequential_19/dense_17/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/sequential_19/dense_17/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/sequential_19/dense_17/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/sequential_19/dense_17/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/sequential_19/dense_17/Tensordot/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "384"}, {"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/sequential_19/dense_16/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/sequential_19/dense_16/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/sequential_19/dense_16/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/sequential_19/dense_16/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/sequential_19/dense_16/Tensordot/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "192"}, {"size": "384"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/layer_normalization_19/batchnorm/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/linear_self_attention_8/einsum_dense_17/add/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/layer_normalization_18/batchnorm/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/sequential_18/dense_15/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/sequential_18/dense_15/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/sequential_18/dense_15/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/sequential_18/dense_15/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/sequential_18/dense_15/Tensordot/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "384"}, {"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/sequential_18/dense_14/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/sequential_18/dense_14/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/sequential_18/dense_14/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/sequential_18/dense_14/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/sequential_18/dense_14/Tensordot/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "192"}, {"size": "384"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/layer_normalization_17/batchnorm/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/linear_self_attention_7/einsum_dense_15/add/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/layer_normalization_16/batchnorm/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/sequential_17/dense_13/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/sequential_17/dense_13/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/sequential_17/dense_13/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/sequential_17/dense_13/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/sequential_17/dense_13/Tensordot/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "384"}, {"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/sequential_17/dense_12/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/sequential_17/dense_12/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/sequential_17/dense_12/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/sequential_17/dense_12/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/sequential_17/dense_12/Tensordot/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "192"}, {"size": "384"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/layer_normalization_15/batchnorm/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/linear_self_attention_6/einsum_dense_13/add/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/layer_normalization_14/batchnorm/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/mul_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/mul_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/Reshape_1/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/layer_normalization_14/moments/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/layer_normalization_14/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/layer_normalization_14/batchnorm/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/layer_normalization_14/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/linear_self_attention_6/einsum_dense_12/einsum/Einsum/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "192"}, {"size": "385"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/linear_self_attention_6/einsum_dense_12/add/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "385"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/linear_self_attention_6/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/linear_self_attention_6/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/linear_self_attention_6/concat", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/linear_self_attention_6/concat_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/linear_self_attention_6/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/linear_self_attention_6/einsum_dense_13/einsum/Einsum/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "192"}, {"size": "192"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/layer_normalization_15/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/layer_normalization_15/moments/variance/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/layer_normalization_15/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/layer_normalization_15/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/sequential_17/dense_12/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/sequential_17/dense_12/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/sequential_17/dense_12/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/sequential_17/dense_12/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/sequential_17/dense_12/BiasAdd/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/sequential_17/dense_13/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/sequential_17/dense_13/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/sequential_17/dense_13/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/sequential_17/dense_13/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_6/sequential_17/dense_13/BiasAdd/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/layer_normalization_16/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/layer_normalization_16/moments/variance/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/layer_normalization_16/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/layer_normalization_16/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/linear_self_attention_7/einsum_dense_14/einsum/Einsum/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "192"}, {"size": "385"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/linear_self_attention_7/einsum_dense_14/add/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "385"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/linear_self_attention_7/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/linear_self_attention_7/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/linear_self_attention_7/concat", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/linear_self_attention_7/concat_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/linear_self_attention_7/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/linear_self_attention_7/einsum_dense_15/einsum/Einsum/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "192"}, {"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/layer_normalization_17/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/layer_normalization_17/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/layer_normalization_17/batchnorm/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/layer_normalization_17/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/sequential_18/dense_14/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/sequential_18/dense_14/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/sequential_18/dense_14/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/sequential_18/dense_14/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/sequential_18/dense_14/BiasAdd/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/sequential_18/dense_15/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/sequential_18/dense_15/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/sequential_18/dense_15/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/sequential_18/dense_15/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_7/sequential_18/dense_15/BiasAdd/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/layer_normalization_18/moments/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/layer_normalization_18/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/layer_normalization_18/batchnorm/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/layer_normalization_18/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/linear_self_attention_8/einsum_dense_16/einsum/Einsum/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "192"}, {"size": "385"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/linear_self_attention_8/einsum_dense_16/add/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "385"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/linear_self_attention_8/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/linear_self_attention_8/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/linear_self_attention_8/concat", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/linear_self_attention_8/concat_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/linear_self_attention_8/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/linear_self_attention_8/einsum_dense_17/einsum/Einsum/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "192"}, {"size": "192"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/layer_normalization_19/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/layer_normalization_19/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/layer_normalization_19/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/layer_normalization_19/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/sequential_19/dense_16/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/sequential_19/dense_16/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/sequential_19/dense_16/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/sequential_19/dense_16/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/sequential_19/dense_16/BiasAdd/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/sequential_19/dense_17/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/sequential_19/dense_17/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/sequential_19/dense_17/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/sequential_19/dense_17/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/transformer_8/sequential_19/dense_17/BiasAdd/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/layer_normalization_20/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/layer_normalization_20/moments/variance/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/layer_normalization_20/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/sequential_20/layer_normalization_20/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/transpose_2/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/mul_5", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/transpose_3/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "unknown_202", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "unknown_203", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-3/Reshape_3/shape/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/layer_normalization_13/batchnorm/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_5/sequential_13/dense_11/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_5/sequential_13/dense_11/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_5/sequential_13/dense_11/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_5/sequential_13/dense_11/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_5/sequential_13/dense_11/Tensordot/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "288"}, {"size": "144"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_5/sequential_13/dense_10/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_5/sequential_13/dense_10/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_5/sequential_13/dense_10/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_5/sequential_13/dense_10/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_5/sequential_13/dense_10/Tensordot/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "144"}, {"size": "288"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_5/layer_normalization_12/batchnorm/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_5/linear_self_attention_5/einsum_dense_11/add/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "144"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_5/layer_normalization_11/batchnorm/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_4/sequential_12/dense_9/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_4/sequential_12/dense_9/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_4/sequential_12/dense_9/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_4/sequential_12/dense_9/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_4/sequential_12/dense_9/Tensordot/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "288"}, {"size": "144"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_4/sequential_12/dense_8/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_4/sequential_12/dense_8/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_4/sequential_12/dense_8/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_4/sequential_12/dense_8/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_4/sequential_12/dense_8/Tensordot/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "144"}, {"size": "288"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_4/layer_normalization_10/batchnorm/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_4/linear_self_attention_4/einsum_dense_9/add/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "144"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_4/layer_normalization_9/batchnorm/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_3/sequential_11/dense_7/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_3/sequential_11/dense_7/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_3/sequential_11/dense_7/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_3/sequential_11/dense_7/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_3/sequential_11/dense_7/Tensordot/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "288"}, {"size": "144"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_3/sequential_11/dense_6/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_3/sequential_11/dense_6/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_3/sequential_11/dense_6/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_3/sequential_11/dense_6/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/MobileViT-v3_v2_0.75/MobileViTBlock-2/sequential_14/transformer_3/sequential_11/dense_6/Tensordot/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": 