{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"INPUT","class_name":"InputLayer","config":{"batch_input_shape":[null,144000],"dtype":"float32","sparse":false,"name":"INPUT"},"inbound_nodes":[]},{"name":"MEL_SPEC1","class_name":"MelSpecLayerSimple","config":{"name":"MEL_SPEC1","trainable":false},"inbound_nodes":[[["INPUT",0,0,{}]]]},{"name":"MEL_SPEC2","class_name":"MelSpecLayerSimple","config":{"name":"MEL_SPEC2","trainable":false},"inbound_nodes":[[["INPUT",0,0,{}]]]},{"name":"concatenate","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate","trainable":false},"inbound_nodes":[[["MEL_SPEC1",0,0,{}],["MEL_SPEC2",0,0,{}]]]},{"name":"BNORM_SPEC_NOQUANT","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"BNORM_SPEC_NOQUANT","trainable":false},"inbound_nodes":[[["concatenate",0,0,{}]]]},{"name":"CONV_0","class_name":"Conv2D","config":{"filters":24,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":42}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[4,8],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"CONV_0","trainable":false},"inbound_nodes":[[["BNORM_SPEC_NOQUANT",0,0,{}]]]},{"name":"BNORM_0","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"BNORM_0","trainable":false},"inbound_nodes":[[["CONV_0",0,0,{}]]]},{"name":"ACT_0","class_name":"Activation","config":{"activation":"relu","name":"ACT_0","trainable":false},"inbound_nodes":[[["BNORM_0",0,0,{}]]]},{"name":"POOL_0_MAX","class_name":"MaxPooling2D","config":{"pool_size":[1,2],"padding":"valid","strides":[1,2],"data_format":"channels_last","name":"POOL_0_MAX","trainable":false},"inbound_nodes":[[["ACT_0",0,0,{}]]]},{"name":"POOL_0_AVG","class_name":"AveragePooling2D","config":{"pool_size":[1,2],"padding":"valid","strides":[1,2],"data_format":"channels_last","name":"POOL_0_AVG","trainable":false},"inbound_nodes":[[["ACT_0",0,0,{}]]]},{"name":"POOL_0_CONCAT","class_name":"Concatenate","config":{"axis":-1,"name":"POOL_0_CONCAT","trainable":false},"inbound_nodes":[[["POOL_0_MAX",0,0,{}],["POOL_0_AVG",0,0,{}]]]},{"name":"POOL_0_ACT_QUANT","class_name":"Activation","config":{"activation":"linear","name":"POOL_0_ACT_QUANT","trainable":false},"inbound_nodes":[[["POOL_0_CONCAT",0,0,{}]]]},{"name":"POOL_0_CONV","class_name":"Conv2D","config":{"filters":24,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"POOL_0_CONV","trainable":false},"inbound_nodes":[[["POOL_0_ACT_QUANT",0,0,{}]]]},{"name":"BLOCK_1-1_CONV_1","class_name":"Conv2D","config":{"filters":72,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_1-1_CONV_1","trainable":false},"inbound_nodes":[[["POOL_0_CONV",0,0,{}]]]},{"name":"BLOCK_1-1_BN_1","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.999,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"BLOCK_1-1_BN_1","trainable":false},"inbound_nodes":[[["BLOCK_1-1_CONV_1",0,0,{}]]]},{"name":"BLOCK_1-1_ACT_1","class_name":"Activation","config":{"activation":"swish","name":"BLOCK_1-1_ACT_1","trainable":false},"inbound_nodes":[[["BLOCK_1-1_BN_1",0,0,{}]]]},{"name":"BLOCK_1-1_PAD","class_name":"ZeroPadding2D","config":{"padding":[[1,1],[1,1]],"data_format":"channels_last","name":"BLOCK_1-1_PAD","trainable":false},"inbound_nodes":[[["BLOCK_1-1_ACT_1",0,0,{}]]]},{"name":"BLOCK_1-1_CONV_2","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[2,2],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_1-1_CONV_2","trainable":false,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["BLOCK_1-1_PAD",0,0,{}]]]},{"name":"BLOCK_1-1_BN_2","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.999,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"BLOCK_1-1_BN_2","trainable":false},"inbound_nodes":[[["BLOCK_1-1_CONV_2",0,0,{}]]]},{"name":"BLOCK_1-1_ACT_2","class_name":"Activation","config":{"activation":"swish","name":"BLOCK_1-1_ACT_2","trainable":false},"inbound_nodes":[[["BLOCK_1-1_BN_2",0,0,{}]]]},{"name":"BLOCK_1-1_CONV_3","class_name":"Conv2D","config":{"filters":36,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_1-1_CONV_3","trainable":false},"inbound_nodes":[[["BLOCK_1-1_ACT_2",0,0,{}]]]},{"name":"BLOCK_1-2_CONV_1","class_name":"Conv2D","config":{"filters":72,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_1-2_CONV_1","trainable":false},"inbound_nodes":[[["BLOCK_1-1_CONV_3",0,0,{}]]]},{"name":"BLOCK_1-2_BN_1","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.999,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"BLOCK_1-2_BN_1","trainable":false},"inbound_nodes":[[["BLOCK_1-2_CONV_1",0,0,{}]]]},{"name":"BLOCK_1-2_ACT_1","class_name":"Activation","config":{"activation":"swish","name":"BLOCK_1-2_ACT_1","trainable":false},"inbound_nodes":[[["BLOCK_1-2_BN_1",0,0,{}]]]},{"name":"BLOCK_1-2_CONV_2","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_1-2_CONV_2","trainable":false,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["BLOCK_1-2_ACT_1",0,0,{}]]]},{"name":"BLOCK_1-2_BN_2","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.999,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"BLOCK_1-2_BN_2","trainable":false},"inbound_nodes":[[["BLOCK_1-2_CONV_2",0,0,{}]]]},{"name":"BLOCK_1-2_ACT_2","class_name":"Activation","config":{"activation":"swish","name":"BLOCK_1-2_ACT_2","trainable":false},"inbound_nodes":[[["BLOCK_1-2_BN_2",0,0,{}]]]},{"name":"BLOCK_1-2_CONV_3","class_name":"Conv2D","config":{"filters":36,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_1-2_CONV_3","trainable":false},"inbound_nodes":[[["BLOCK_1-2_ACT_2",0,0,{}]]]},{"name":"BLOCK_1-2_DO","class_name":"Dropout","config":{"rate":0.1,"noise_shape":[null,1,1,1],"seed":null,"name":"BLOCK_1-2_DO","trainable":false},"inbound_nodes":[[["BLOCK_1-2_CONV_3",0,0,{}]]]},{"name":"BLOCK_1-2_ADD","class_name":"Add","config":{"name":"BLOCK_1-2_ADD","trainable":false},"inbound_nodes":[[["BLOCK_1-2_DO",0,0,{}],["BLOCK_1-1_CONV_3",0,0,{}]]]},{"name":"BLOCK_1-3_CONV_1","class_name":"Conv2D","config":{"filters":72,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_1-3_CONV_1","trainable":false},"inbound_nodes":[[["BLOCK_1-2_ADD",0,0,{}]]]},{"name":"BLOCK_1-3_BN_1","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.999,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"BLOCK_1-3_BN_1","trainable":false},"inbound_nodes":[[["BLOCK_1-3_CONV_1",0,0,{}]]]},{"name":"BLOCK_1-3_ACT_1","class_name":"Activation","config":{"activation":"swish","name":"BLOCK_1-3_ACT_1","trainable":false},"inbound_nodes":[[["BLOCK_1-3_BN_1",0,0,{}]]]},{"name":"BLOCK_1-3_CONV_2","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_1-3_CONV_2","trainable":false,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["BLOCK_1-3_ACT_1",0,0,{}]]]},{"name":"BLOCK_1-3_BN_2","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.999,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"BLOCK_1-3_BN_2","trainable":false},"inbound_nodes":[[["BLOCK_1-3_CONV_2",0,0,{}]]]},{"name":"BLOCK_1-3_ACT_2","class_name":"Activation","config":{"activation":"swish","name":"BLOCK_1-3_ACT_2","trainable":false},"inbound_nodes":[[["BLOCK_1-3_BN_2",0,0,{}]]]},{"name":"BLOCK_1-3_CONV_3","class_name":"Conv2D","config":{"filters":36,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_1-3_CONV_3","trainable":false},"inbound_nodes":[[["BLOCK_1-3_ACT_2",0,0,{}]]]},{"name":"BLOCK_1-3_DO","class_name":"Dropout","config":{"rate":0.1,"noise_shape":[null,1,1,1],"seed":null,"name":"BLOCK_1-3_DO","trainable":false},"inbound_nodes":[[["BLOCK_1-3_CONV_3",0,0,{}]]]},{"name":"BLOCK_1-3_ADD","class_name":"Add","config":{"name":"BLOCK_1-3_ADD","trainable":false},"inbound_nodes":[[["BLOCK_1-3_DO",0,0,{}],["BLOCK_1-2_ADD",0,0,{}]]]},{"name":"BLOCK_2-1_CONV_1","class_name":"Conv2D","config":{"filters":288,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_2-1_CONV_1","trainable":false},"inbound_nodes":[[["BLOCK_1-3_ADD",0,0,{}]]]},{"name":"BLOCK_2-1_BN_1","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.999,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"BLOCK_2-1_BN_1","trainable":false},"inbound_nodes":[[["BLOCK_2-1_CONV_1",0,0,{}]]]},{"name":"BLOCK_2-1_ACT_1","class_name":"Activation","config":{"activation":"swish","name":"BLOCK_2-1_ACT_1","trainable":false},"inbound_nodes":[[["BLOCK_2-1_BN_1",0,0,{}]]]},{"name":"BLOCK_2-1_PAD","class_name":"ZeroPadding2D","config":{"padding":[[1,1],[1,1]],"data_format":"channels_last","name":"BLOCK_2-1_PAD","trainable":false},"inbound_nodes":[[["BLOCK_2-1_ACT_1",0,0,{}]]]},{"name":"BLOCK_2-1_CONV_2","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[2,2],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_2-1_CONV_2","trainable":false,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["BLOCK_2-1_PAD",0,0,{}]]]},{"name":"BLOCK_2-1_BN_2","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.999,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"BLOCK_2-1_BN_2","trainable":false},"inbound_nodes":[[["BLOCK_2-1_CONV_2",0,0,{}]]]},{"name":"BLOCK_2-1_ACT_2","class_name":"Activation","config":{"activation":"swish","name":"BLOCK_2-1_ACT_2","trainable":false},"inbound_nodes":[[["BLOCK_2-1_BN_2",0,0,{}]]]},{"name":"BLOCK_2-1_SE_AVG_POOL_1","class_name":"GlobalAveragePooling2D","config":{"data_format":"channels_last","name":"BLOCK_2-1_SE_AVG_POOL_1","trainable":false},"inbound_nodes":[[["BLOCK_2-1_ACT_2",0,0,{}]]]},{"name":"BLOCK_2-1_SE_RESHAPE","class_name":"Reshape","config":{"target_shape":[1,1,288],"name":"BLOCK_2-1_SE_RESHAPE","trainable":false},"inbound_nodes":[[["BLOCK_2-1_SE_AVG_POOL_1",0,0,{}]]]},{"name":"BLOCK_2-1_SE_CONV_1","class_name":"Conv2D","config":{"filters":18,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"swish","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_2-1_SE_CONV_1","trainable":false},"inbound_nodes":[[["BLOCK_2-1_SE_RESHAPE",0,0,{}]]]},{"name":"BLOCK_2-1_SE_CONV_2","class_name":"Conv2D","config":{"filters":288,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"sigmoid","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_2-1_SE_CONV_2","trainable":false},"inbound_nodes":[[["BLOCK_2-1_SE_CONV_1",0,0,{}]]]},{"name":"BLOCK_2-1_MULTIPLY","class_name":"Multiply","config":{"name":"BLOCK_2-1_MULTIPLY","trainable":false},"inbound_nodes":[[["BLOCK_2-1_ACT_2",0,0,{}],["BLOCK_2-1_SE_CONV_2",0,0,{}]]]},{"name":"BLOCK_2-1_CONV_3","class_name":"Conv2D","config":{"filters":72,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_2-1_CONV_3","trainable":false},"inbound_nodes":[[["BLOCK_2-1_MULTIPLY",0,0,{}]]]},{"name":"BLOCK_2-2_CONV_1","class_name":"Conv2D","config":{"filters":288,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_2-2_CONV_1","trainable":false},"inbound_nodes":[[["BLOCK_2-1_CONV_3",0,0,{}]]]},{"name":"BLOCK_2-2_BN_1","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.999,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"BLOCK_2-2_BN_1","trainable":false},"inbound_nodes":[[["BLOCK_2-2_CONV_1",0,0,{}]]]},{"name":"BLOCK_2-2_ACT_1","class_name":"Activation","config":{"activation":"swish","name":"BLOCK_2-2_ACT_1","trainable":false},"inbound_nodes":[[["BLOCK_2-2_BN_1",0,0,{}]]]},{"name":"BLOCK_2-2_CONV_2","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_2-2_CONV_2","trainable":false,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["BLOCK_2-2_ACT_1",0,0,{}]]]},{"name":"BLOCK_2-2_BN_2","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.999,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"BLOCK_2-2_BN_2","trainable":false},"inbound_nodes":[[["BLOCK_2-2_CONV_2",0,0,{}]]]},{"name":"BLOCK_2-2_ACT_2","class_name":"Activation","config":{"activation":"swish","name":"BLOCK_2-2_ACT_2","trainable":false},"inbound_nodes":[[["BLOCK_2-2_BN_2",0,0,{}]]]},{"name":"BLOCK_2-2_SE_AVG_POOL_1","class_name":"GlobalAveragePooling2D","config":{"data_format":"channels_last","name":"BLOCK_2-2_SE_AVG_POOL_1","trainable":false},"inbound_nodes":[[["BLOCK_2-2_ACT_2",0,0,{}]]]},{"name":"BLOCK_2-2_SE_RESHAPE","class_name":"Reshape","config":{"target_shape":[1,1,288],"name":"BLOCK_2-2_SE_RESHAPE","trainable":false},"inbound_nodes":[[["BLOCK_2-2_SE_AVG_POOL_1",0,0,{}]]]},{"name":"BLOCK_2-2_SE_CONV_1","class_name":"Conv2D","config":{"filters":18,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"swish","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_2-2_SE_CONV_1","trainable":false},"inbound_nodes":[[["BLOCK_2-2_SE_RESHAPE",0,0,{}]]]},{"name":"BLOCK_2-2_SE_CONV_2","class_name":"Conv2D","config":{"filters":288,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"sigmoid","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_2-2_SE_CONV_2","trainable":false},"inbound_nodes":[[["BLOCK_2-2_SE_CONV_1",0,0,{}]]]},{"name":"BLOCK_2-2_MULTIPLY","class_name":"Multiply","config":{"name":"BLOCK_2-2_MULTIPLY","trainable":false},"inbound_nodes":[[["BLOCK_2-2_ACT_2",0,0,{}],["BLOCK_2-2_SE_CONV_2",0,0,{}]]]},{"name":"BLOCK_2-2_CONV_3","class_name":"Conv2D","config":{"filters":72,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_2-2_CONV_3","trainable":false},"inbound_nodes":[[["BLOCK_2-2_MULTIPLY",0,0,{}]]]},{"name":"BLOCK_2-2_DO","class_name":"Dropout","config":{"rate":0.1,"noise_shape":[null,1,1,1],"seed":null,"name":"BLOCK_2-2_DO","trainable":false},"inbound_nodes":[[["BLOCK_2-2_CONV_3",0,0,{}]]]},{"name":"BLOCK_2-2_ADD","class_name":"Add","config":{"name":"BLOCK_2-2_ADD","trainable":false},"inbound_nodes":[[["BLOCK_2-2_DO",0,0,{}],["BLOCK_2-1_CONV_3",0,0,{}]]]},{"name":"BLOCK_2-3_CONV_1","class_name":"Conv2D","config":{"filters":288,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_2-3_CONV_1","trainable":false},"inbound_nodes":[[["BLOCK_2-2_ADD",0,0,{}]]]},{"name":"BLOCK_2-3_BN_1","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.999,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"BLOCK_2-3_BN_1","trainable":false},"inbound_nodes":[[["BLOCK_2-3_CONV_1",0,0,{}]]]},{"name":"BLOCK_2-3_ACT_1","class_name":"Activation","config":{"activation":"swish","name":"BLOCK_2-3_ACT_1","trainable":false},"inbound_nodes":[[["BLOCK_2-3_BN_1",0,0,{}]]]},{"name":"BLOCK_2-3_CONV_2","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_2-3_CONV_2","trainable":false,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["BLOCK_2-3_ACT_1",0,0,{}]]]},{"name":"BLOCK_2-3_BN_2","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.999,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"BLOCK_2-3_BN_2","trainable":false},"inbound_nodes":[[["BLOCK_2-3_CONV_2",0,0,{}]]]},{"name":"BLOCK_2-3_ACT_2","class_name":"Activation","config":{"activation":"swish","name":"BLOCK_2-3_ACT_2","trainable":false},"inbound_nodes":[[["BLOCK_2-3_BN_2",0,0,{}]]]},{"name":"BLOCK_2-3_SE_AVG_POOL_1","class_name":"GlobalAveragePooling2D","config":{"data_format":"channels_last","name":"BLOCK_2-3_SE_AVG_POOL_1","trainable":false},"inbound_nodes":[[["BLOCK_2-3_ACT_2",0,0,{}]]]},{"name":"BLOCK_2-3_SE_RESHAPE","class_name":"Reshape","config":{"target_shape":[1,1,288],"name":"BLOCK_2-3_SE_RESHAPE","trainable":false},"inbound_nodes":[[["BLOCK_2-3_SE_AVG_POOL_1",0,0,{}]]]},{"name":"BLOCK_2-3_SE_CONV_1","class_name":"Conv2D","config":{"filters":18,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"swish","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_2-3_SE_CONV_1","trainable":false},"inbound_nodes":[[["BLOCK_2-3_SE_RESHAPE",0,0,{}]]]},{"name":"BLOCK_2-3_SE_CONV_2","class_name":"Conv2D","config":{"filters":288,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"sigmoid","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_2-3_SE_CONV_2","trainable":false},"inbound_nodes":[[["BLOCK_2-3_SE_CONV_1",0,0,{}]]]},{"name":"BLOCK_2-3_MULTIPLY","class_name":"Multiply","config":{"name":"BLOCK_2-3_MULTIPLY","trainable":false},"inbound_nodes":[[["BLOCK_2-3_ACT_2",0,0,{}],["BLOCK_2-3_SE_CONV_2",0,0,{}]]]},{"name":"BLOCK_2-3_CONV_3","class_name":"Conv2D","config":{"filters":72,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_2-3_CONV_3","trainable":false},"inbound_nodes":[[["BLOCK_2-3_MULTIPLY",0,0,{}]]]},{"name":"BLOCK_2-3_DO","class_name":"Dropout","config":{"rate":0.1,"noise_shape":[null,1,1,1],"seed":null,"name":"BLOCK_2-3_DO","trainable":false},"inbound_nodes":[[["BLOCK_2-3_CONV_3",0,0,{}]]]},{"name":"BLOCK_2-3_ADD","class_name":"Add","config":{"name":"BLOCK_2-3_ADD","trainable":false},"inbound_nodes":[[["BLOCK_2-3_DO",0,0,{}],["BLOCK_2-2_ADD",0,0,{}]]]},{"name":"BLOCK_2-4_CONV_1","class_name":"Conv2D","config":{"filters":288,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_2-4_CONV_1","trainable":false},"inbound_nodes":[[["BLOCK_2-3_ADD",0,0,{}]]]},{"name":"BLOCK_2-4_BN_1","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.999,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"BLOCK_2-4_BN_1","trainable":false},"inbound_nodes":[[["BLOCK_2-4_CONV_1",0,0,{}]]]},{"name":"BLOCK_2-4_ACT_1","class_name":"Activation","config":{"activation":"swish","name":"BLOCK_2-4_ACT_1","trainable":false},"inbound_nodes":[[["BLOCK_2-4_BN_1",0,0,{}]]]},{"name":"BLOCK_2-4_CONV_2","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_2-4_CONV_2","trainable":false,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["BLOCK_2-4_ACT_1",0,0,{}]]]},{"name":"BLOCK_2-4_BN_2","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.999,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"BLOCK_2-4_BN_2","trainable":false},"inbound_nodes":[[["BLOCK_2-4_CONV_2",0,0,{}]]]},{"name":"BLOCK_2-4_ACT_2","class_name":"Activation","config":{"activation":"swish","name":"BLOCK_2-4_ACT_2","trainable":false},"inbound_nodes":[[["BLOCK_2-4_BN_2",0,0,{}]]]},{"name":"BLOCK_2-4_SE_AVG_POOL_1","class_name":"GlobalAveragePooling2D","config":{"data_format":"channels_last","name":"BLOCK_2-4_SE_AVG_POOL_1","trainable":false},"inbound_nodes":[[["BLOCK_2-4_ACT_2",0,0,{}]]]},{"name":"BLOCK_2-4_SE_RESHAPE","class_name":"Reshape","config":{"target_shape":[1,1,288],"name":"BLOCK_2-4_SE_RESHAPE","trainable":false},"inbound_nodes":[[["BLOCK_2-4_SE_AVG_POOL_1",0,0,{}]]]},{"name":"BLOCK_2-4_SE_CONV_1","class_name":"Conv2D","config":{"filters":18,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"swish","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_2-4_SE_CONV_1","trainable":false},"inbound_nodes":[[["BLOCK_2-4_SE_RESHAPE",0,0,{}]]]},{"name":"BLOCK_2-4_SE_CONV_2","class_name":"Conv2D","config":{"filters":288,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"sigmoid","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_2-4_SE_CONV_2","trainable":false},"inbound_nodes":[[["BLOCK_2-4_SE_CONV_1",0,0,{}]]]},{"name":"BLOCK_2-4_MULTIPLY","class_name":"Multiply","config":{"name":"BLOCK_2-4_MULTIPLY","trainable":false},"inbound_nodes":[[["BLOCK_2-4_ACT_2",0,0,{}],["BLOCK_2-4_SE_CONV_2",0,0,{}]]]},{"name":"BLOCK_2-4_CONV_3","class_name":"Conv2D","config":{"filters":72,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_2-4_CONV_3","trainable":false},"inbound_nodes":[[["BLOCK_2-4_MULTIPLY",0,0,{}]]]},{"name":"BLOCK_2-4_DO","class_name":"Dropout","config":{"rate":0.1,"noise_shape":[null,1,1,1],"seed":null,"name":"BLOCK_2-4_DO","trainable":false},"inbound_nodes":[[["BLOCK_2-4_CONV_3",0,0,{}]]]},{"name":"BLOCK_2-4_ADD","class_name":"Add","config":{"name":"BLOCK_2-4_ADD","trainable":false},"inbound_nodes":[[["BLOCK_2-4_DO",0,0,{}],["BLOCK_2-3_ADD",0,0,{}]]]},{"name":"BLOCK_3-1_CONV_1","class_name":"Conv2D","config":{"filters":864,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_3-1_CONV_1","trainable":false},"inbound_nodes":[[["BLOCK_2-4_ADD",0,0,{}]]]},{"name":"BLOCK_3-1_BN_1","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.999,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"BLOCK_3-1_BN_1","trainable":false},"inbound_nodes":[[["BLOCK_3-1_CONV_1",0,0,{}]]]},{"name":"BLOCK_3-1_ACT_1","class_name":"Activation","config":{"activation":"swish","name":"BLOCK_3-1_ACT_1","trainable":false},"inbound_nodes":[[["BLOCK_3-1_BN_1",0,0,{}]]]},{"name":"BLOCK_3-1_PAD","class_name":"ZeroPadding2D","config":{"padding":[[1,1],[1,1]],"data_format":"channels_last","name":"BLOCK_3-1_PAD","trainable":false},"inbound_nodes":[[["BLOCK_3-1_ACT_1",0,0,{}]]]},{"name":"BLOCK_3-1_CONV_2","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[2,2],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_3-1_CONV_2","trainable":false,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["BLOCK_3-1_PAD",0,0,{}]]]},{"name":"BLOCK_3-1_BN_2","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.999,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"BLOCK_3-1_BN_2","trainable":false},"inbound_nodes":[[["BLOCK_3-1_CONV_2",0,0,{}]]]},{"name":"BLOCK_3-1_ACT_2","class_name":"Activation","config":{"activation":"swish","name":"BLOCK_3-1_ACT_2","trainable":false},"inbound_nodes":[[["BLOCK_3-1_BN_2",0,0,{}]]]},{"name":"BLOCK_3-1_SE_AVG_POOL_1","class_name":"GlobalAveragePooling2D","config":{"data_format":"channels_last","name":"BLOCK_3-1_SE_AVG_POOL_1","trainable":false},"inbound_nodes":[[["BLOCK_3-1_ACT_2",0,0,{}]]]},{"name":"BLOCK_3-1_SE_RESHAPE","class_name":"Reshape","config":{"target_shape":[1,1,864],"name":"BLOCK_3-1_SE_RESHAPE","trainable":false},"inbound_nodes":[[["BLOCK_3-1_SE_AVG_POOL_1",0,0,{}]]]},{"name":"BLOCK_3-1_SE_CONV_1","class_name":"Conv2D","config":{"filters":27,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"swish","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_3-1_SE_CONV_1","trainable":false},"inbound_nodes":[[["BLOCK_3-1_SE_RESHAPE",0,0,{}]]]},{"name":"BLOCK_3-1_SE_CONV_2","class_name":"Conv2D","config":{"filters":864,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"sigmoid","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_3-1_SE_CONV_2","trainable":false},"inbound_nodes":[[["BLOCK_3-1_SE_CONV_1",0,0,{}]]]},{"name":"BLOCK_3-1_MULTIPLY","class_name":"Multiply","config":{"name":"BLOCK_3-1_MULTIPLY","trainable":false},"inbound_nodes":[[["BLOCK_3-1_ACT_2",0,0,{}],["BLOCK_3-1_SE_CONV_2",0,0,{}]]]},{"name":"BLOCK_3-1_CONV_3","class_name":"Conv2D","config":{"filters":108,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_3-1_CONV_3","trainable":false},"inbound_nodes":[[["BLOCK_3-1_MULTIPLY",0,0,{}]]]},{"name":"BLOCK_3-2_CONV_1","class_name":"Conv2D","config":{"filters":864,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_3-2_CONV_1","trainable":false},"inbound_nodes":[[["BLOCK_3-1_CONV_3",0,0,{}]]]},{"name":"BLOCK_3-2_BN_1","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.999,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"BLOCK_3-2_BN_1","trainable":false},"inbound_nodes":[[["BLOCK_3-2_CONV_1",0,0,{}]]]},{"name":"BLOCK_3-2_ACT_1","class_name":"Activation","config":{"activation":"swish","name":"BLOCK_3-2_ACT_1","trainable":false},"inbound_nodes":[[["BLOCK_3-2_BN_1",0,0,{}]]]},{"name":"BLOCK_3-2_CONV_2","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_3-2_CONV_2","trainable":false,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["BLOCK_3-2_ACT_1",0,0,{}]]]},{"name":"BLOCK_3-2_BN_2","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.999,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"BLOCK_3-2_BN_2","trainable":false},"inbound_nodes":[[["BLOCK_3-2_CONV_2",0,0,{}]]]},{"name":"BLOCK_3-2_ACT_2","class_name":"Activation","config":{"activation":"swish","name":"BLOCK_3-2_ACT_2","trainable":false},"inbound_nodes":[[["BLOCK_3-2_BN_2",0,0,{}]]]},{"name":"BLOCK_3-2_SE_AVG_POOL_1","class_name":"GlobalAveragePooling2D","config":{"data_format":"channels_last","name":"BLOCK_3-2_SE_AVG_POOL_1","trainable":false},"inbound_nodes":[[["BLOCK_3-2_ACT_2",0,0,{}]]]},{"name":"BLOCK_3-2_SE_RESHAPE","class_name":"Reshape","config":{"target_shape":[1,1,864],"name":"BLOCK_3-2_SE_RESHAPE","trainable":false},"inbound_nodes":[[["BLOCK_3-2_SE_AVG_POOL_1",0,0,{}]]]},{"name":"BLOCK_3-2_SE_CONV_1","class_name":"Conv2D","config":{"filters":27,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"swish","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_3-2_SE_CONV_1","trainable":false},"inbound_nodes":[[["BLOCK_3-2_SE_RESHAPE",0,0,{}]]]},{"name":"BLOCK_3-2_SE_CONV_2","class_name":"Conv2D","config":{"filters":864,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"sigmoid","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_3-2_SE_CONV_2","trainable":false},"inbound_nodes":[[["BLOCK_3-2_SE_CONV_1",0,0,{}]]]},{"name":"BLOCK_3-2_MULTIPLY","class_name":"Multiply","config":{"name":"BLOCK_3-2_MULTIPLY","trainable":false},"inbound_nodes":[[["BLOCK_3-2_ACT_2",0,0,{}],["BLOCK_3-2_SE_CONV_2",0,0,{}]]]},{"name":"BLOCK_3-2_CONV_3","class_name":"Conv2D","config":{"filters":108,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_3-2_CONV_3","trainable":false},"inbound_nodes":[[["BLOCK_3-2_MULTIPLY",0,0,{}]]]},{"name":"BLOCK_3-2_DO","class_name":"Dropout","config":{"rate":0.1,"noise_shape":[null,1,1,1],"seed":null,"name":"BLOCK_3-2_DO","trainable":false},"inbound_nodes":[[["BLOCK_3-2_CONV_3",0,0,{}]]]},{"name":"BLOCK_3-2_ADD","class_name":"Add","config":{"name":"BLOCK_3-2_ADD","trainable":false},"inbound_nodes":[[["BLOCK_3-2_DO",0,0,{}],["BLOCK_3-1_CONV_3",0,0,{}]]]},{"name":"BLOCK_3-3_CONV_1","class_name":"Conv2D","config":{"filters":864,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"BLOCK_3-3_CONV_1","trainable":false},"inbound_nodes":[[["BLOCK_3-2_ADD",0,0,{}]]]},{"name":"BLOCK_3-3_BN_1","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.999,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"BLOCK_3-3_BN_1","trainable":false},"inbound_nodes":[[["BLOCK_3-3_CONV_1",0,0,{}]]]},{"name":"BLOCK_3-3_ACT_1","class_name":"Activation","config":{"activation":"swish","name":"BLOCK_3-3_ACT_1","trainable":false},"inbound_nodes":[[["BLOCK_3-3_BN_1",0,0,{}]]]},{"name":"BLOCK_3-3_CONV_2","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,