[
    {
      "id": null,
      "textContent": "Preguntas frecuentes sobre los registros de eBird"
    },
    {
      "id": null,
      "textContent": "¿Qué es eBird?"
    },
    {
      "id": null,
      "textContent": "eBird"
    },
    {
      "id": null,
      "textContent": "es una plataforma online diseñada para compartir datos de observaciones de aves gestionada por el Departamento de Ornitología de la Universidad de Cornell (EE.UU.)."
    },
    {
      "id": null,
      "textContent": "¿Qué es un archivo de registro de eBird?"
    },
    {
      "id": null,
      "textContent": "El archivo de registro es una hoja de cálculo con datos de observaciones de aves que se puede subir a la plataforma eBird."
    },
    {
      "id": null,
      "textContent": "¿Cómo organiza Chirpity mis detecciones?"
    },
    {
      "id": null,
      "textContent": "La aplicación crea una lista de verificación para cada archivo asociado con la exportación. Estas listas contienen un total de detecciones de reclamos para cada especie del archivo. Si usted ha indicado un número concreto de reclamos, se utiliza esa cifra; de lo contrario, se asumirá que hay un solo reclamo."
    },
    {
      "id": null,
      "textContent": "El archivo exportado contiene una fila de cabecera que explica lo que representa cada columna. Usted puede consultar"
    },
    {
      "id": null,
      "textContent": "más detalles"
    },
    {
      "id": null,
      "textContent": "en la web de eBird."
    },
    {
      "id": null,
      "textContent": "Importante:"
    },
    {
      "id": null,
      "textContent": "Hay que eliminar la fila de cabecera antes de subir el archivo."
    },
    {
      "id": null,
      "textContent": "¿Cómo puedo subir mi archivo de registros de eBird?"
    },
    {
      "id": null,
      "textContent": "Vaya a"
    },
    {
      "id": null,
      "textContent": "eBird"
    },
    {
      "id": null,
      "textContent": " y cree una cuenta o entre en su cuenta de eBird. Una vez tenga una cuenta y haya entrado, vaya al"
    },
    {
      "id": null,
      "textContent": "formulario de importación"
    },
    {
      "id": null,
      "textContent": "."
    },
    {
      "id": null,
      "textContent": "Haga click en \"Seleccionar archivo\" y seleccione el archivo que haya preparado"
    },
    {
      "id": null,
      "textContent": "Importante:"
    },
    {
      "id": null,
      "textContent": "elija \"Formato (Extendido)\""
    },
    {
      "id": null,
      "textContent": "Haga click en \"Cargar archivo\""
    },
    {
      "id": null,
      "textContent": "¿Por qué da error cuando trato de subir el archivo?"
    },
    {
      "id": null,
      "textContent": "Primero, verifique que se haya eliminado la fila de cabecera; eBird sólo admite archivos en los que en la primera fila aparezca una observación."
    },
    {
      "id": null,
      "textContent": "Si ese no fuese el problema y usted detecta errores relacionados con especies no reconocidas, asegúrese de que las preferencias de idioma configuradas en Chirpity coincidan con las de su cuenta de eBird."
    },
    {
      "id": null,
      "textContent": "¿Por qué aparecen las columnas de Estado/Provincia en blanco?"
    },
    {
      "id": null,
      "textContent": "Estos campos son opcionales en el formato de registro de eBird. Aunque la API de búsqueda de lugares de OpenStreetMap utilizada por Chirpity proporciona el Estado y la provincia, no los ofrece en el formato utilizado por eBird. Usted puede buscar el formato correcto para su país o provincia en la siguiente"
    },
    {
      "id": null,
      "textContent": "hoja de cálculo"
    },
    {
      "id": null,
      "textContent": "."
    },
    {
      "id": null,
      "textContent": "¿Por qué has elegido eBird? ¿Tienes pensado que se puedan compartir registros con otras plataformas?"
    },
    {
      "id": null,
      "textContent": "eBird es la plataforma más sencilla de usar. Esto se debe a que tiene un formato de registro publicado y, quizá lo más importante, la taxonomía de eBird concuerda con la utilizada por los modelos BirdNET y Nocmig."
    },
    {
      "id": null,
      "textContent": "Espero poder ofrecer la posibilidad de compartir clips de audio con Xeno-Canto en futuras versiones. Esto dependerá de que ellos publiquen una API de carga adecuada."
    },
    {
      "id": null,
      "textContent": "La responsabilidad de verificar la exactitud del archivo de registro depende exclusivamente de usted. Chirpity no puede garantizar de ningún modo la precisión de los datos en los archivos de registro. Al usar esta función, usted acepta estos términos y está de acuerdo con ello."
    }
  ]