{
  "file-handling": [
    "Gestión de archivos"
    ],
    "show-file-open": [
      "Mostrar el cuadro de diálogo de apertura de archivo"
    ],
    "save-detections": [
      "Guardar las detecciones en el archivo de registros."
    ],
    "analysis": [
      "Análisis"
    ],
    "analyse-file": [
      "Analizar el archivo actual."
    ],
    "analyeALL": [
      "Analizar todos los archivos abiertos."
    ],
    "stop-analysis": [
      "Detener el análisis"
    ],
    "toggle-archive": [
      "Alternar entre explorar el archivo y los resultados de análisis más recientes. Esto permite comparar las detecciones actuales con las grabadas previamente."
    ],
    "navigate-audio": [
      "Navegar en el audio"
    ],
    "play-pause": [
      "Alternar reproducción/pausa del audio"
    ],
    "play-region": [
      "Reproducir la parte seleccionada. Solo está activo si se ha seleccionado una parte."
    ],
    "center-spec": [
      "Centrar el sonograma en la posición actual del cabezal de reproducción. Además, si se hace doble clic en un punto del audio, el sonograma se centrará en ese punto."
    ],
    "go-to": [
      "Ir a una posición en el archivo"
    ],
    "file-begin": [
      "Mover el cabezal de reproducción al principio del archivo"
    ],
    "file-end": [
      "Mover el cabezal de reproducción al final del archivo"
    ],
    "pageup": [
      "Retroceder al periodo anterior en el sonograma. También se puede usar la rueda del ratón o el deslizamiento con dos dedos en el trackpad."
    ],
    "pagedown": [
      "Avanzar al siguiente periodo en el sonograma"
    ],
    "skip-forward": [
      "Mover el cabezal de reproducción hacia adelante."
    ],
    "skip-back": [
      "Mover el cabezal de reproducción hacia atrás."
    ],
    "next-detection": [
      "Saltar a la siguiente detección"
    ],
    "previous-detection": [
      "Saltar a la detección anterior"
    ],
    "spec-adjust": [
      "Ajustes del sonograma"
    ],
    "zoom-in": [
      "Acercar el sonograma. Al hacer zoom, Chirpity ajusta automáticamente el tamaño de la ventana de la transformada de Fourier de tiempo corto (STFT) para optimizar la resolución espectral"
    ],
    "zoom-out": [
      "Alejar el sonograma. Al hacer zoom, Chirpity ajusta automáticamente el tamaño de la ventana STFT para optimizar la resolución espectral"
    ],
    "reduce-fft": [
      "Reducir manualmente el tamaño de la ventana del sonograma. Ajustar el tamaño de la ventana tiene el efecto de agrandar o difuminar los reclamos en el espectrograma."
    ],
    "increase-fft": [
      "Aumentar manualmente el tamaño de la ventana del sonograma"
    ],
    "timeline-toggle": [
      "Alternar entre tiempo transcurrido en el sonograma y la hora del día según la hora inicial de grabación"
    ],
    "records": [
      "Registros"
    ],
    "delete": [
      "Eliminar el registro actual"
    ],
    "undo": [
      "Restaurar el/los registro(s) eliminado(s)"
    ],
    "validate": [
      "Validar el registro activo actual (confirmar la detección)"
    ]
  }
  